[
{"USERNAME": "Michael", "rating": ["3.0"], "TEXT": "Update 5 months after having returned the Arctis 9, and using the Arctis Pro. The Arctis Pro has proved to be more reliable - still working with no issues. If you can tolerate the higher price and the disadvantages I listed below, I would recommend the Arctis Pro instead of the Arctis 9.1 further update to the disadvantage list for the arctis pro, is that it does have a major issue in the firmware that makes the bluetooth volume mute then increase whenever your phone switches audio device (eg. Changing from Music to phone call). Some apps that don't keep the audio running (Duolingo as an example) are basically unusable. I had a lengthy exchange with Steelseries and they passed it to the dev team but they have yet to confirm they will address it. I therefore cannot recommend the Pro for people who use bluetooth. If you plan to use bluetooth a lot I would suggest trying the Arctis 9 and hope that your set is more reliable than mine. Or look to another brand.--------Update after 5 months (Feb):I've lowered the rating from 4/5 to 3/5For the following reasons:- with further use, I liked the headphones more and more, so I would've put the score up if it wasn't for the next points.  I just generally found they were really useful for my life, so I would take them everywhere - using them at home and at work. I found myself using the dual wireless/bluetooth input all the time.- In the past 5 months, I've had 2 units fail.-- The first one, it was a mechanical failure of the power button. It stopped making the click sound when you press it, and also apparently stopped making electrical contact. As a result I was unable to switch the headphones on.  I returned them to Amazon for a replacement (that experience was very good, I had my replacement the next day).-- The 2nd one failed in 2 ways.  Firstly, it stopped switching on - instead flashing red as if the battery was flat.  If I plugged it in then it would switch on, but it was a struggle to get it to pair with the dongle.  If I unplugged the power, then it would unpair and switch off immediately.  HOWEVER. If I switch it on and then connect with bluetooth, it would pair fine and I could unplug the power and use it as normal. Also, while connected to bluetooth, it was seemingly impossible to pair with the PC.  The 2nd failure was a mechanical failure, whereby one of the ear cups became detached from the headband.  I'm again returning it to Amazon, though this time they only offered a refund.Despite the 2 failures, I was seriously considering giving these headphones another try, as I really love them and they generally review well and there wasn't an obvious alternative at a similar price point.  In the end I decided it would be better to try another set, so topped up the refund money and got the Arctis Wireless Pro headphones instead.For people who are wondering whether to get these ones or Arctis Pro, I'd say it's not a clear no-brainer about which headphones are better.  In general I'd say both are really great and I enjoy them both.  Here is a quick comparison of the 2.  Note that at the time of this writing I've only had 1 day with the Arctis Pro.Things I prefer about Arctis 9:- seem to be a bit more comfortable for me - Actis Pro seem a bit tighter- it has 2 separate volume control wheels - one main and one chatmix.  Arctis Pro has a single \"smart wheel\".  Personally I prefer my controls to have a single purpose so there's no brain power needed.- when on bluetooth, the volume control is separate from the device bluetooth volume, meaning it's instantaneous. Artis Pro controls the device volume which (for my phone) has a bit of lag to it- the USB dongle is much smaller, which is more friendly for laptop/travel- the positioning of the volume wheel and mic mute button seem more natural to me. Maybe it's muscle memory but I have a much easier time finding them on the Arctis 9.- the price! They're about half the price of the Arctis Pro- The dongle seems to be more reliable at staying \"connected\" to the PC. I use Voicemeeter, and I've had 1 occasion where it lost connection to the Arctis Pro base station - meaning I had to restart the voicemeeter engine. I haven't had such issue with the Actis 9 dongle.- the 3.5 mm input on the dongle is an extra input (I think).  With the Actis Pro, you have to choose to enable the aux input, and it steals one of the USB devices presented to the PC (ie. you can have 2 USB sound devices, or 1 aux + 1 USB sound device)Things I prefer about Arctis Pro:- You can connect a cable to the headphones to use a 3.5mm jack- the USB dongle (base station?) doesn't need a PC to function properly.  You can connect it to a USB power supply and the 3.5mm aux input works.  On the Arctis 9, the 3.5mm input doesn't work unless you have it connected to a PC.- It's quite nice being able to change some of the settings from the base station rather than have to use the steel series software- it comes with 2 changeable batteries, and the base station is also the battery charger. It's really nice that you never have to connect the headphones to a charge- the fact that these headphones control the bluetooth device volume means you can independantly control the bluetooth and USB volumes.  On arctis 9, you just have a master headphone volume and the chat mix.  Meaning from the arctis 9 headphones it's not possible to turn down the PC sound and keep the bluetooth sound.- I like that the \"smart wheel\" volume control is configurable.  It always will be able to set volume, but you can press it to toggle to other controls - chat mix, source selection, EQ and possibly something else. Personally I think having everything is too complicated if you can't see the screen, so I was glad I could change it to just volume and chat mix- There is a red light on the microphone to tell you when it's muted. I like on the actis pro you can dim or turn off this light. on the arctis 9 I found it was too bright and normally put a bit of tape over it.- You can dim the screen and make it turn off after a timeout to make it less annoying in the dark. The Arctis 9 dongle has a light that's either always on or blinking.  In the dark it's too bright really.Which would I choose? Ignoring the reliability issue, I would say I actually prefer it even if price wasn't a factor.  As a laptop user, the massive base station is almost a deal-breaker.  There are definite benefits to the Actis Pro that I do like (I love the changeable batteries and the better support for 3.5mm inputs) but for me it's not a clear winner - and for a set of headphones that are twice the price they really should be better in every possible way to justify it.  For non-laptop users I could see that the base station wouldn't be such a negative, possibly even a positive for those who like that sort of thing.For me both are 9/10 headphones which I generally love but have some niggles.  The choice between them isn't a clear thing and would come down to your personal preferences and budget.As for the reliability question - I will have to reserve judgement until I've had more time with the Actis Pro to see if they are any better.-----------Original ReviewThis is my first time buying a decent set of headphones so I couldn't compare to other similar products.  Compared to the cheap ones I've been using in the past, these are lightyears ahead.  In general, I'm really happy with the headphones, but there are some minor niggles, which is why I say they're 9/10 headphones for me.What I like:- sound quality is pretty good. I'm not an audiophile, but I don't notice anything wrong with the sound.- I like having the volume control wheel- It presents as 2 audio devices, so you can have sound from 2 sources and individually control the volume.  The cross-fade wheel on the headset for this is quite nice.  The manual describes this as for game and chat, but for me I'll probably use it for game and youtube, since I like to watch youtube while playing some games and only sometimes turn up the game audio.- retractable mic with a hardware mute button.  When muted, the button is raised and the mic is lit up red so you know.- wireless with PC and bluetooth to phone works at the same time.- range seems decent - at least within my flat I haven't lost signal- comfort is ok- sound from microphone seems decent enough- plugging in the charging cable doesn't switch them off (I've had a set of headphones where they did)What I don't like:- high price - tbh, for this sort of price I would expect them to be almost perfect in the execution of the features it has.- the crossfade wheel doesn't affect bluetooth audio & the software doesn't allow this to be configured.  There's also no way to adjust the bluetooth volume separately, only the master volume and the crossfade of the other sources.- they're quite warm on the ears- the analogue audio input is on the USB dongle rather than the headset itself, so you can't use a 3.5mm jack without USB power- the USB dongle is pretty big and on a long cable.  Fine if you're on a desk, but not so good with a laptop.- I installed the steel series software and found it was missing the 1 feature I installed it for: to decide which audio inputs are affected by the crossfade and which is which.What I haven't tried yet:- moving the dongle to another PC - I would hope there wouldn't be a need to re-pair them- connecting to a 2nd bluetooth device - how is the experience swapping over, etc? can it remember both devices at the same time? or do we need to re-pair each time we want to switch?- noise cancelling on the mic - in one of the promo videos it looks pretty good, but I've yet to try.- battery life/charging timeSo would I recommend these headphones? Maybe - if you're ok with the price and it meets your needs.  I suspect there may be better deals out there though.  Saying that, I am happy with them and will keep them without regret.Edit:I've tested: - the noise cancellation on the mic in the car.  It's not as good as I expected from the promo video.  You could hear my voice fine, but you can also hear a lot of the sounds from driving. - switching the USB dongle to another PC. it was pretty seamless and I didn't have to pair it again\n  \n"},
{"USERNAME": "MH", "rating": ["4.0"], "TEXT": "Pros:- Microphone. Nice and clear, dedicated mute button, and easy to deploy/retract. Never had an issue of friends being unable to hear me in Discord.- Sound. It's a gaming headset, and it makes games sound good. It's not the highest audio tier because that's not what you're paying for.- Audio mixing. The ability to mix between \"chat\" and \"game\" is a amazing feature and I wish more headsets had this! I can very easily balance the audio from discord and the game I'm playing on the fly, which has become such an integral part of how I play games now I'm not going to go back to a single audio channel solution anytime soon. I thought it would be a bit of a gimmick but turns out the be the best feature.Battery. Lasts in my experience 20 hours without a charge, which for someone like myself that is online for maybe 4 hours an evening is perfect as I can charge it pretty much once a week. Not had it die on me yet!Cons:- Not for big heads. My head is apparently a little larger than most, and therefore I have the adjustment strap adjusted all the way to the end, in fact I've only got half of the velcro attached! I haven't noticed this to be uncomfortable, however if I knew this in advance I wouldn't have purchased this.Verdict - It's a great headset and the audio mixing isn't just a gimmick but a major plus point, however sadly I can only recommend this to people with smaller or \"normal\" sized heads :(\n  \n"},
{"USERNAME": "sam", "rating": ["4.0"], "TEXT": "I wanted a gaming headset that I could wear on a plane or train and not look like I’m on the way to gaming convention. I really look the subtle look and functionality of these. The look and feel like a premium product and they seem like they’ll last a while. Sadly, they are let down by scratchy and itchy ear pads.The headphones connect well to everything PS5, MacBook phone etc. The sound quality is really good.  I wish there was a phone app to tweak the sound settings like turtle beach have.  You have to connect to a computer to alter the settings.As already mentioned, the big downside is the comfort of the ear pads. The material is scratchy and itchy, on the skin on the side of your face. I noticed that after a wearing them for a little while 15-20 mins they started to feel uncomfortable.  I don’t suffer with any allergies or skin sensitivity whatsoever.  The ear pads are actually slight too small for me. I don’t have big ears but after a few hours these begin to become painful/achy. I reached out to steelseries via twitter and had no reply at all.I’m probably going to end up having to spend £20 on a better set of ear pads, which isn’t great when I’ve only just bought them. They are not the most expensive headset around but they aren’t exactly cheap either.  I’ll probably opt for cooling gel ear pads if I’m forced to upgrade.I’m confident these will be more comfortable once I have some third party ear pads but I wish I’d known beforehand and could have factored the extra cost into my decision to buy. If you’re going to buy these, see if you try them on somewhere first.\n  \n"}
]