[
{"USERNAME": "I Like Lego", "rating": ["5.0"], "TEXT": "It’s very easy and simple to play, other than how bad my drawing skills are, perfect for any age. Nice and compact for travel, but obviously if the box opens, a lot falls out (not really a problem). Fun and challenging yet still simple. Would recommend to anyone of any age.\n  \n"},
{"USERNAME": "MaryFlav", "rating": ["5.0"], "TEXT": "This ended up better than we thought it would be.  The time goes very quick, so suggest you make it 2 minutes instead of 1 when playing with younger children.  We had a good hour playing with this at Christmas.\n  \n"},
{"USERNAME": "pamela chesterman", "rating": ["5.0"], "TEXT": "Even if you can't draw this is such a fun game for family and friends. We had such a laugh trying to guess each others drawings. It gives a real insight into how people see objects/the world too! Definitely worth the money. Compact size for easy storage when not in use, which is also very helpful.\n  \n"},
{"USERNAME": "Anne-Marie Medjber", "rating": ["4.0"], "TEXT": "Super little game, we all played, ages 6 - 60s  great fun\n  \n"},
{"USERNAME": "Libby Romain", "rating": ["5.0"], "TEXT": "Just love this little game. It creates such fun especially in larger groups. You can bend the rules to suit your group dynamics.\n  \n"},
{"USERNAME": "orla wedlock", "rating": ["5.0"], "TEXT": "For our artistic game loving family this is the best game ever we all had a laugh and everyone could get involved. Only thing I would say is it should have a timer but yet used the Alexia and it was so fun. We all laughed and had a great time.\n  \n"},
{"USERNAME": "Karrie Henderson", "rating": ["5.0"], "TEXT": "Bought for a birthday present. Played with adults and it was hilarious. Could play with kids too\n  \n"},
{"USERNAME": "wordsmyth", "rating": ["5.0"], "TEXT": "We bought this for a family Christmas get together. Simple and fun, it can be played whilst lounging after Christmas turkey. Great for all ages… we changed the rules to 2 mins to accommodate some slower guests.Will Gamely be making more cards? Have nearly come to the end of the pack.\n  \n"}
]